{"id":"eea01cc7-a03a-4686-bf56-5f346d6c8c16","updated_at":"2025-01-11T17:51:58.129Z","updated_by":"1835883509","created_at":"2025-01-11T17:51:58.129Z","created_by":"1835883509","name":"nmap scan","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detecting all the nmap scans","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://siem-lab-1.kb.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"7442b52b-c7ec-4e30-925b-200f3fc0f6c6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.action: \"nmap_scan\"","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
